SRGBmods/qmk-8051/tmk_core/protocol/ch555/ch555_usb_stack.c
/*
 * Copyright 2012 Jun Wako <wakojun@gmail.com>
 * This file is based on:
 *     LUFA-120219/Demos/Device/Lowlevel/KeyboardMouse
 *     LUFA-120219/Demos/Device/Lowlevel/GenericHID
 */

/*
             LUFA Library
     Copyright (C) Dean Camera, 2012.

  dean [at] fourwalledcubicle [dot] com
           www.lufa-lib.org
*/

#define send_report(endpoint,report,size) _send_report_EP(endpoint,report,size)
#define _send_report_EP(endpoint,report,size) send_report_EP##endpoint(report,size)

#define read_EP(endpoint,report,size) _read_EP(endpoint,report,size)
#define _read_EP(endpoint,report,size) read_EP##endpoint(report,size)

#include "report.h"
#include "host.h"
#include "host_driver.h"
#include "keyboard.h"
#include "action.h"
#include "led.h"
#include "sendchar.h"
#include "debug.h"
#ifdef SLEEP_LED_ENABLE
#    include "sleep_led.h"
#endif
#include "suspend.h"
#include "wait.h"

#include "usb_descriptor.h"
#include "ch555_usb_stack.h" 
#include "hal.h" //for clock config
#include "usb_device.h" //for USB device & Endpoint init, location for EndPoint buffers
#include "usb_device_state.h"
#include "atomic_util.h"

#ifdef NKRO_ENABLE
#    include "keycode_config.h"

extern keymap_config_t keymap_config;
#endif

#ifdef VIRTSER_ENABLE
#    include "virtser.h"
#endif

#ifdef MIDI_ENABLE
#    include "qmk_midi.h"
#endif

#ifdef RAW_ENABLE
#    include "raw_hid.h"
#endif

uint8_t keyboard_idle = 0;
/* 0: Boot Protocol, 1: Report Protocol(default) */
uint8_t        keyboard_protocol  = 1;
static uint8_t keyboard_led_state = 0;

static report_keyboard_t keyboard_report_sent;

/* Host driver */
static uint8_t keyboard_leds(void);
static void    send_keyboard(report_keyboard_t *report);
static void    send_mouse(report_mouse_t *report);
static void    send_extra(report_extra_t *report);
host_driver_t  ch555_usb_stack_driver = {keyboard_leds, send_keyboard, send_mouse, send_extra};



#ifdef USE_D0_EP1_IN
void send_report_EP1(void *report, size_t size) {
    //print("SP");
    //printf("%x\n",SP);
    //uint8_t timeout = 255;

    //if (USB_DeviceState != DEVICE_STATE_Configured) return;

    //Endpoint_SelectEndpoint(endpoint);

    //// Check if write ready for a polling interval around 10ms 
    //while (timeout-- && !Endpoint_IsReadWriteAllowed()) {
    //    _delay_us(40);
    //}
    //if (!Endpoint_IsReadWriteAllowed()) return;

    //Endpoint_Write_Stream_LE(report, size, NULL);
    //Endpoint_ClearIN();


    if (!USB_EnumStatus) return;
	if( USB_SleepStatus == 0x03 )
	{
		USB_WakeUp_PC( );
	}

    // Check if write ready for a polling interval around 10ms 
    uint8_t timeout = 255;
    while (timeout-- && ( ( D0_EP1RES & MASK_UEP_X_RES ) == UEP_X_RES_ACK )) {
        wait_us(40);
    }
    if ( ( D0_EP1RES & MASK_UEP_X_RES ) == UEP_X_RES_ACK ) return;
	
	memcpy( pUSB_BUF_DEV0 + UX_EP1_ADDR, (uint8_t *)report, size );
	D0_EP1RES ^= bUEP_X_TOG;	
	D0_EP1T_L = size;                                       
	D0_EP1RES = D0_EP1RES & ~MASK_UEP_X_RES | UEP_X_RES_ACK;               
}
#endif
#ifdef USE_D0_EP2_IN
void send_report_EP2(void *report, size_t size) {
    if (!USB_EnumStatus) return;
	if( USB_SleepStatus == 0x03 )
	{
		USB_WakeUp_PC( );
	}

    // Check if write ready for a polling interval around 10ms 
    uint8_t timeout = 255;
    while (timeout-- && ( ( D0_EP2RES & MASK_UEP_X_RES ) == UEP_X_RES_ACK )) {
        wait_us(40);
    }
    if ( ( D0_EP2RES & MASK_UEP_X_RES ) == UEP_X_RES_ACK ) return;
	
	memcpy( pUSB_BUF_DEV0 + UX_EP2_ADDR, (uint8_t *)report, size );
	D0_EP2RES ^= bUEP_X_TOG;	
	D0_EP2T_L = size;                                       
	D0_EP2RES = D0_EP2RES & ~MASK_UEP_X_RES | UEP_X_RES_ACK;               
}
#endif
#ifdef USE_D0_EP3_IN
void send_report_EP3(void *report, size_t size) {
    if (!USB_EnumStatus) return;
	if( USB_SleepStatus == 0x03 )
	{
		USB_WakeUp_PC( );
	}

    // Check if write ready for a polling interval around 10ms 
    uint8_t timeout = 255;
    while (timeout-- && ( ( D0_EP3RES & MASK_UEP_X_RES ) == UEP_X_RES_ACK )) {
        wait_us(40);
    }
    if ( ( D0_EP3RES & MASK_UEP_X_RES ) == UEP_X_RES_ACK ) return;
	
	memcpy( pUSB_BUF_DEV0 + UX_EP3_ADDR, (uint8_t *)report, size );
	D0_EP3RES ^= bUEP_X_TOG;	
	D0_EP3T_L = size;                                       
	D0_EP3RES = D0_EP3RES & ~MASK_UEP_X_RES | UEP_X_RES_ACK;               
}
#endif
#ifdef USE_D0_EP4_IN
void send_report_EP4(void *report, size_t size) {
    if (!USB_EnumStatus) return;
	if( USB_SleepStatus == 0x03 )
	{
		USB_WakeUp_PC( );
	}

    // Check if write ready for a polling interval around 10ms 
    uint8_t timeout = 255;
    while (timeout-- && ( ( D0_EP4RES & MASK_UEP_X_RES ) == UEP_X_RES_ACK )) {
        wait_us(40);
    }
    if ( ( D0_EP4RES & MASK_UEP_X_RES ) == UEP_X_RES_ACK ) return;
	
	memcpy( pUSB_BUF_DEV0 + UX_EP4_ADDR, (uint8_t *)report, size );
	D0_EP4RES ^= bUEP_X_TOG;	
	D0_EP4T_L = size;                                       
	D0_EP4RES = D0_EP4RES & ~MASK_UEP_X_RES | UEP_X_RES_ACK;               
}
#endif
#ifdef USE_D0_EP5_IN
void send_report_EP5(void *report, size_t size) {
    if (!USB_EnumStatus) return;
	if( USB_SleepStatus == 0x03 )
	{
		USB_WakeUp_PC( );
	}

    // Check if write ready for a polling interval around 10ms 
    uint8_t timeout = 255;
    while (timeout-- && ( ( D0_EP5RES & MASK_UEP_X_RES ) == UEP_X_RES_ACK )) {
        wait_us(40);
    }
    if ( ( D0_EP5RES & MASK_UEP_X_RES ) == UEP_X_RES_ACK ) return;
	
	memcpy( pUSB_BUF_DEV0 + UX_EP5_ADDR, (uint8_t *)report, size );
	D0_EP5RES ^= bUEP_X_TOG;	
	D0_EP5T_L = size;                                       
	D0_EP5RES = D0_EP5RES & ~MASK_UEP_X_RES | UEP_X_RES_ACK;               
}
#endif

//#define D0_EPxRES_BASE_ADDR   2200 
/*
void send_report(uint8_t endpoint, void *report, size_t size) {

    if (!USB_EnumStatus) return;
	if( USB_SleepStatus == 0x03 )
	{
		USB_WakeUp_PC( );
	}

	memcpy( pUSB_BUF_DEV0 + (UX_EP1_ADDR<<(endpoint-1)), (uint8_t *)report, size );
    uint8_t volatile __xdata *D0_EPxRES = XSFR_USBD0_BASE + endpoint;
    uint8_t volatile __xdata *D0_EPxT_L = D0_EPxRES + 8;

	while( ( *D0_EPxRES & MASK_UEP_X_RES ) == UEP_X_RES_ACK );                  
	
	*D0_EPxRES ^= bUEP_X_TOG;	
	*D0_EPxT_L = size;                                       
	*D0_EPxRES = *D0_EPxRES & ~MASK_UEP_X_RES | UEP_X_RES_ACK;               
} */

#ifdef USE_D0_EP1_OUT
bool read_EP1(void *report, size_t size) {
	if ( ep1_data_wait ) {                 
        ep1_data_wait = 0;
	    memcpy( report, pUSB_BUF_DEV0 + UX_EP1_ADDR, size );
	    D0_EP1RES ^= bUEP_X_TOG;	
	    D0_EP1RES = D0_EP1RES & ~MASK_UEP_X_RES | UEP_X_RES_ACK;               
        return true; //read data success
    }
    return false; //no data
}
#endif
#ifdef USE_D0_EP2_OUT
bool read_EP2(void *report, size_t size) {
	if ( ep2_data_wait ) {                 
        ep2_data_wait = 0;
	    memcpy( report, pUSB_BUF_DEV0 + UX_EP2_ADDR, size );
	    D0_EP2RES ^= bUEP_X_TOG;	
	    D0_EP2RES = D0_EP2RES & ~MASK_UEP_X_RES | UEP_X_RES_ACK;               
        return true; //read data success
    }
    return false; //no data
}
#endif
#ifdef USE_D0_EP3_OUT
bool read_EP3(void *report, size_t size) {
	if ( ep3_data_wait ) {                 
        ep3_data_wait = 0;
	    memcpy( report, pUSB_BUF_DEV0 + UX_EP3_ADDR, size );
	    D0_EP3RES ^= bUEP_X_TOG;	
	    D0_EP3RES = D0_EP3RES & ~MASK_UEP_X_RES | UEP_X_RES_ACK;               
        return true; //read data success
    }
    return false; //no data
}
#endif
#ifdef USE_D0_EP4_OUT
bool read_EP4(void *report, size_t size) {
	if ( ep4_data_wait ) {                 
        ep4_data_wait = 0;
	    memcpy( report, pUSB_BUF_DEV0 + UX_EP4_ADDR, size );
	    D0_EP4RES ^= bUEP_X_TOG;	
	    D0_EP4RES = D0_EP4RES & ~MASK_UEP_X_RES | UEP_X_RES_ACK;               
        return true; //read data success
    }
    return false; //no data
}
#endif

#ifdef VIRTSER_ENABLE
// clang-format off

USB_ClassInfo_CDC_Device_t cdc_device = {
    .Config = {
        .ControlInterfaceNumber = CCI_INTERFACE,
        .DataINEndpoint = {
            .Address            = (CDC_IN_EPNUM | ENDPOINT_DIR_IN),
            .Size               = CDC_EPSIZE,
            .Banks              = 1
        },
        .DataOUTEndpoint = {
            .Address            = (CDC_OUT_EPNUM | ENDPOINT_DIR_OUT),
            .Size               = CDC_EPSIZE,
            .Banks              = 1
        },
        .NotificationEndpoint = {
            .Address            = (CDC_NOTIFICATION_EPNUM | ENDPOINT_DIR_IN),
            .Size               = CDC_NOTIFICATION_EPSIZE,
            .Banks              = 1
        }
    }
};

// clang-format on
#endif

