SRGBmods/qmk-8051/tmk_core/protocol/ch555/ch555_usb_stack.c
#ifdef RAW_ENABLE

/** \brief Raw HID Send
 *
 * FIXME: Needs doc
 */
void raw_hid_send(uint8_t *data, uint8_t length) {
    if (length != RAW_EPSIZE) return;
    send_report(RAW_IN_EPNUM, data, RAW_EPSIZE);
    //send_report(2, data, RAW_EPSIZE);
}

/** \brief Raw HID Receive
 *
 * FIXME: Needs doc
 */
#ifndef VIA_ENABLE
void raw_hid_receive(uint8_t *data, uint8_t length) {
    // Users should #include "raw_hid.h" in their own code
    // and implement this function there. Leave this as weak linkage
    // so users can opt to not handle data coming in.
}
#endif

/** \brief Raw HID Task
 *
 * FIXME: Needs doc
 */
//extern volatile UINT8  ep3_data_wait;											/* endpoint 3 data waiting flag*/
static void raw_hid_task(void) {
    // Create a temporary buffer to hold the read in data from the host
    uint8_t data[RAW_EPSIZE];
    bool    data_read = false;

    // Device must be connected and configured for the task to run
    //if (USB_DeviceState != DEVICE_STATE_Configured) return;
    if (!USB_EnumStatus) return;

    //Endpoint_SelectEndpoint(RAW_OUT_EPNUM);

    //// Check to see if a packet has been sent from the host
    //if (Endpoint_IsOUTReceived()) {
    //    // Check to see if the packet contains data
    //    if (Endpoint_IsReadWriteAllowed()) {
    //        /* Read data */
    //        Endpoint_Read_Stream_LE(data, sizeof(data), NULL);
    //        data_read = true;
    //    }

    //    // Finalize the stream transfer to receive the last packet
    //    Endpoint_ClearOUT();

    //    if (data_read) {
    //        raw_hid_receive(data, sizeof(data));
    //    }
    //}

	//if ( ep3_data_wait ) {                 
    //    ep3_data_wait = 0;
	//    memcpy( data, pUSB_BUF_DEV0 + UX_EP3_ADDR, RAW_EPSIZE );
	//    D0_EP3RES ^= bUEP_X_TOG;	
	//    D0_EP3RES = D0_EP3RES & ~MASK_UEP_X_RES | UEP_X_RES_ACK;               

    //    raw_hid_receive(data, sizeof(data));
    //}
    data_read = read_EP(RAW_OUT_EPNUM,data,RAW_EPSIZE);
    if (data_read) {
        raw_hid_receive(data, sizeof(data));
    }
}
#endif

/*******************************************************************************
 * Console
 ******************************************************************************/
#ifdef CONSOLE_ENABLE
/** \brief Console Task
 *
 * FIXME: Needs doc
 */
static void Console_Task(void) {
    /* Device must be connected and configured for the task to run */
    if (USB_DeviceState != DEVICE_STATE_Configured) return;

    uint8_t ep = Endpoint_GetCurrentEndpoint();

#    if 0
    // TODO: impl receivechar()/recvchar()
    Endpoint_SelectEndpoint(CONSOLE_OUT_EPNUM);

    /* Check to see if a packet has been sent from the host */
    if (Endpoint_IsOUTReceived())
    {
        /* Check to see if the packet contains data */
        if (Endpoint_IsReadWriteAllowed())
        {
            /* Create a temporary buffer to hold the read in report from the host */
            uint8_t ConsoleData[CONSOLE_EPSIZE];

            /* Read Console Report Data */
            Endpoint_Read_Stream_LE(&ConsoleData, sizeof(ConsoleData), NULL);

            /* Process Console Report Data */
            //ProcessConsoleHIDReport(ConsoleData);
        }

        /* Finalize the stream transfer to send the last packet */
        Endpoint_ClearOUT();
    }
#    endif

    /* IN packet */
    Endpoint_SelectEndpoint(CONSOLE_IN_EPNUM);
    if (!Endpoint_IsEnabled() || !Endpoint_IsConfigured()) {
        Endpoint_SelectEndpoint(ep);
        return;
    }

    // fill empty bank
    while (Endpoint_IsReadWriteAllowed())
        Endpoint_Write_8(0);

    // flush sendchar packet
    if (Endpoint_IsINReady()) {
        Endpoint_ClearIN();
    }

    Endpoint_SelectEndpoint(ep);
}
#endif

/*******************************************************************************
 * USB Events
 ******************************************************************************/
/*
 * Event Order of Plug in:
 * 0) EVENT_USB_Device_Connect
 * 1) EVENT_USB_Device_Suspend
 * 2) EVENT_USB_Device_Reset
 * 3) EVENT_USB_Device_Wake
 */
/** \brief Event USB Device Connect
 *
 * FIXME: Needs doc
 */
//void EVENT_USB_Device_Connect(void) {
//    print("[C]");
//    /* For battery powered device */
//    if (!USB_IsInitialized) {
//        USB_Disable();
//        USB_Init();
//        USB_Device_EnableSOFEvents();
//    }
//}

/** \brief Event USB Device Connect
 *
 * FIXME: Needs doc
 */
//void EVENT_USB_Device_Disconnect(void) {
//    print("[D]");
//    /* For battery powered device */
//    USB_IsInitialized = false;
//    /* TODO: This doesn't work. After several plug in/outs can not be enumerated.
//        if (USB_IsInitialized) {
//            USB_Disable();  // Disable all interrupts
//        USB_Controller_Enable();
//            USB_INT_Enable(USB_INT_VBUSTI);
//        }
//    */
//}

/** \brief Event USB Device Connect
 *
 * FIXME: Needs doc
 */
//void EVENT_USB_Device_Reset(void) {
//    print("[R]");
//    usb_device_state_set_reset();
//}

/** \brief Event USB Device Connect
 *
 * FIXME: Needs doc
 */
//void EVENT_USB_Device_Suspend(void) {
//    print("[S]");
//    usb_device_state_set_suspend(USB_Device_ConfigurationNumber != 0, USB_Device_ConfigurationNumber);
//
//#ifdef SLEEP_LED_ENABLE
//    sleep_led_enable();
//#endif
//}

/** \brief Event USB Device Connect
 *
 * FIXME: Needs doc
 */
//void EVENT_USB_Device_WakeUp(void) {
//    print("[W]");
//#if defined(NO_USB_STARTUP_CHECK)
//    suspend_wakeup_init();
//#endif
//
//    usb_device_state_set_resume(USB_DeviceState == DEVICE_STATE_Configured, USB_Device_ConfigurationNumber);
//
//#ifdef SLEEP_LED_ENABLE
//    sleep_led_disable();
//    // NOTE: converters may not accept this
//    led_set(host_keyboard_leds());
//#endif
//}

#ifdef CONSOLE_ENABLE
static bool console_flush = false;
#    define CONSOLE_FLUSH_SET(b)                \
        do {                                    \
            ATOMIC_BLOCK(ATOMIC_RESTORESTATE) { \
                console_flush = b;              \
            }                                   \
        } while (0)

