SRGBmods/qmk-8051/tmk_core/protocol/ch555/ch555_usb_stack.c
/*******************************************************************************
 * MIDI
 ******************************************************************************/

#ifdef MIDI_ENABLE
// clang-format off

USB_ClassInfo_MIDI_Device_t USB_MIDI_Interface = {
    .Config = {
        .StreamingInterfaceNumber = AS_INTERFACE,
        .DataINEndpoint = {
            .Address              = (MIDI_STREAM_IN_EPNUM | ENDPOINT_DIR_IN),
            .Size                 = MIDI_STREAM_EPSIZE,
            .Banks                = 1
        },
        .DataOUTEndpoint = {
            .Address              = (MIDI_STREAM_OUT_EPNUM | ENDPOINT_DIR_OUT),
            .Size                 = MIDI_STREAM_EPSIZE,
            .Banks                = 1
        }
    }
};

// clang-format on

void send_midi_packet(MIDI_EventPacket_t *event) {
    MIDI_Device_SendEventPacket(&USB_MIDI_Interface, event);
}

bool recv_midi_packet(MIDI_EventPacket_t *const event) {
    return MIDI_Device_ReceiveEventPacket(&USB_MIDI_Interface, event);
}

#endif

/*******************************************************************************
 * VIRTUAL SERIAL
 ******************************************************************************/

#ifdef VIRTSER_ENABLE
/** \brief Virtual Serial Init
 *
 * FIXME: Needs doc
 */
void virtser_init(void) {
    cdc_device.State.ControlLineStates.DeviceToHost = CDC_CONTROL_LINE_IN_DSR;
    CDC_Device_SendControlLineStateChange(&cdc_device);
}

/** \brief Virtual Serial Receive
 *
 * FIXME: Needs doc
 */
void virtser_recv(uint8_t c) ;
void virtser_recv(uint8_t c) {
    // Ignore by default
}

/** \brief Virtual Serial Task
 *
 * FIXME: Needs doc
 */
void virtser_task(void) {
    uint16_t count = CDC_Device_BytesReceived(&cdc_device);
    uint8_t  ch;
    for (; count; --count) {
        ch = CDC_Device_ReceiveByte(&cdc_device);
        virtser_recv(ch);
    }
}
/** \brief Virtual Serial Send
 *
 * FIXME: Needs doc
 */
void virtser_send(const uint8_t byte) {
    uint8_t timeout = 255;
    uint8_t ep      = Endpoint_GetCurrentEndpoint();

    if (cdc_device.State.ControlLineStates.HostToDevice & CDC_CONTROL_LINE_OUT_DTR) {
        /* IN packet */
        Endpoint_SelectEndpoint(cdc_device.Config.DataINEndpoint.Address);

        if (!Endpoint_IsEnabled() || !Endpoint_IsConfigured()) {
            Endpoint_SelectEndpoint(ep);
            return;
        }

        while (timeout-- && !Endpoint_IsReadWriteAllowed())
            _delay_us(40);

        Endpoint_Write_8(byte);
        CDC_Device_Flush(&cdc_device);

        if (Endpoint_IsINReady()) {
            Endpoint_ClearIN();
        }

        Endpoint_SelectEndpoint(ep);
    }
}
#endif

/*******************************************************************************
 * main
 ******************************************************************************/
/** \brief Setup MCU
 *
 * FIXME: Needs doc
 */
static void setup_mcu(void) {
    /* Disable watchdog if enabled by bootloader/fuses */
    //MCUSR &= ~_BV(WDRF);
    //wdt_disable();

// For boards running at 3.3V and crystal at 16 MHz
//#if (F_CPU == 8000000 && F_USB == 16000000)
//    /* Divide clock by 2 */
//    clock_prescale_set(clock_div_2);
//#else /* Disable clock division */
//    clock_prescale_set(clock_div_1);
//#endif
    //CLK_config();
    CfgFsys();
    wait_ms(10); //wait for clock to settle
    mInitSTDIO();
    println("init UART0 done");
}

/** \brief Setup USB
 *
 * FIXME: Needs doc
 */

static void setup_usb(void) {
    // Leonardo needs. Without this USB device is not recognized.
    //USB_Disable();

    //USB_init();
    USB_Device_Init();
  
    // for Console_Task
    //USB_Device_EnableSOFEvents(); TODO implement this 
}

//void HID_EP_init(void) {
//    D0_EP1RES = bUEP_X_AUTO_TOG | UEP_X_RES_NAK;
//    //D0_EP2RES = bUEP_X_AUTO_TOG | UEP_X_RES_ACK;
//    //D0_EP_MOD |= bUX_EP2O_EN;                 //EP1 IN & EP2 OUT
//    HID_writeBusyFlag = 0;                    // reset write busy flag
//}
//
//// Endpoint 1 IN handler (HID report transfer to host completed)
//void HID_EP1_IN(void) {
//  D0_EP1T_L = 0;                                           // no data to send anymore
//  D0_EP1RES = D0_EP1RES & ~MASK_UEP_X_RES | UEP_X_RES_NAK;  // default NAK
//  HID_writeBusyFlag = 0;                          // clear busy flag
//}

// Endpoint 2 OUT handler (HID report transfer from host completed)
// No handling is actually necessary here, the auto-ACK is sufficient.
// The current report can be read from the EP2 buffer.

void protocol_setup(void) {
#ifdef MIDI_ENABLE
    setup_midi();
#endif

    setup_mcu();
    usb_device_state_init();
}

void protocol_pre_init(void) {
    setup_usb();
    println("done init usb");
    //sei();

    /* wait for USB startup & debug output */

#ifdef WAIT_FOR_USB
    while (USB_DeviceState != DEVICE_STATE_Configured) {
#    if defined(INTERRUPT_CONTROL_ENDPOINT)
        ;
#    else
        USB_USBTask();
#    endif
    }
    print("USB configured.\n");
#else
    //USB_USBTask(); //TODO call USB_Device_ProcessControlRequest?? why?
#endif
}

void protocol_post_init(void) {
    host_set_driver(&ch555_usb_stack_driver);
    mDelaymS(1000); //wait some time for the usb enumeration complete. why? No idea.
	P4_LED_KEY = 0xFF; // enable key mode 
}

#define NO_USB_STARTUP_CHECK //TODO implement this 
void protocol_pre_task(void) {
#if !defined(NO_USB_STARTUP_CHECK)
    if (USB_DeviceState == DEVICE_STATE_Suspended) {
        dprintln("suspending keyboard");
        while (USB_DeviceState == DEVICE_STATE_Suspended) {
            suspend_power_down();
            if (USB_Device_RemoteWakeupEnabled && suspend_wakeup_condition()) {
                //USB_Device_SendRemoteWakeup(); TODO implement this
                clear_keyboard();

#    if USB_SUSPEND_WAKEUP_DELAY > 0
                // Some hubs, kvm switches, and monitors do
                // weird things, with USB device state bouncing
                // around wildly on wakeup, yielding race
                // conditions that can corrupt the keyboard state.
                //
                // Pause for a while to let things settle...
                wait_ms(USB_SUSPEND_WAKEUP_DELAY);
#    endif
            }
        }
        suspend_wakeup_init();
    }
#endif
}

void protocol_post_task(void) {
#ifdef MIDI_ENABLE
    MIDI_Device_USBTask(&USB_MIDI_Interface);
#endif

#ifdef VIRTSER_ENABLE
    virtser_task();
    CDC_Device_USBTask(&cdc_device);
#endif

#ifdef RAW_ENABLE
    raw_hid_task();
#endif

#if !defined(INTERRUPT_CONTROL_ENDPOINT)
    //USB_USBTask();
#endif

	if( MCU_Sleep_Operate )
	{
		EA = 0;	
		MCU_Sleep_Operate = 0;			
		SAFE_MOD = 0x55;
		SAFE_MOD = 0xAA;
		WAKE_CTRL |= bWAK_BY_USB;       									/* Wake up when there is signal from Usb */			
//		POWER_CFG |= bPWR_DN_MODE;		
		SAFE_MOD = 0x00;
		CH55X_Sleep_Deal( );  												/* Execute microcontroller sleep operation */
		EA = 1; 	
	}
}

//uint16_t CALLBACK_USB_GetDescriptor(const uint16_t wValue, const uint16_t wIndex, const void **const DescriptorAddress) {
//    return get_usb_descriptor(wValue, wIndex, USB_ControlRequest.wLength, DescriptorAddress);
//}
